Kno1889/embedded-systems-course/L2_FreeRTOS/Experiment_3/board/pin_mux.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: MK66FN2M0xxx18
package_id: MK66FN2M0VMD18
mcu_data: ksdk2_0
processor_version: 0.7.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: E10, peripheral: UART0, signal: RX, pin_signal: TSI0_CH9/PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/SDRAM_D17/EWM_IN/TPM_CLKIN0}
  - {pin_num: E9, peripheral: UART0, signal: TX, pin_signal: TSI0_CH10/PTB17/SPI1_SIN/UART0_TX/FTM_CLKIN1/FB_AD16/SDRAM_D16/EWM_OUT_b/TPM_CLKIN1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
	 /* Port B Clock Gate Control: Clock enabled */
	    CLOCK_EnableClock(kCLOCK_PortB);

	    CLOCK_EnableClock(kCLOCK_PortC);
	        CLOCK_EnableClock(kCLOCK_PortA);
	        CLOCK_EnableClock(kCLOCK_PortE); // PORT E for the UART

	        PORT_SetPinMux(PORTC, 1U, kPORT_MuxAlt4);
	        PORT_SetPinMux(PORTA, 6U, kPORT_MuxAlt3);

	        //set the pin MUX for UART4_TX, UART4_RX, UART4_CTS_B, and UART4_RTS_B
	        PORT_SetPinMux(PORTC, 13U, kPORT_MuxAlt3); //UART4_TX
	        PORT_SetPinMux(PORTC, 14U, kPORT_MuxAlt3); //UART4_RX
	        PORT_SetPinMux(PORTC, 15U, kPORT_MuxAlt3); //UART4_CTS_B
	        PORT_SetPinMux(PORTE, 27U, kPORT_MuxAlt3); //UART4_RTS_B

	    /* PORTB16 (pin E10) is configured as UART0_RX */
	    PORT_SetPinMux(PORTB, 16U, kPORT_MuxAlt3);

	    /* PORTB17 (pin E9) is configured as UART0_TX */
	    PORT_SetPinMux(PORTB, 17U, kPORT_MuxAlt3);

	    SIM->SOPT5 = ((SIM->SOPT5 &
	                   /* Mask bits to zero which are setting */
	                   (~(SIM_SOPT5_UART0TXSRC_MASK)))

	                  /* UART 0 transmit data source select: UART0_TX pin. */
	                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
